app/Controllers/AuthController.php

SELECT COUNT(*) AS `numrows`
FROM `prefixe`
WHERE `code` = '033'
SELECT *
FROM `client`
WHERE `telephone` = '0332440120'
 LIMIT 1
---
    public function processLogin()
    {
        $telephone = trim($this->request->getPost('telephone') ?? '');

        // 1. Vérification du format (exactement 10 chiffres, commence par 0)
        if (!preg_match('/^0[0-9]{9}$/', $telephone)) {
            return redirect()->back()->with('error', 'Le numéro doit contenir 10 chiffres et commencer par 0.');
        }

        // 2. Extraction du préfixe (les 3 premiers chiffres, ex: "033", "037", "032")
        $prefixe = substr($telephone, 0, 3);

        // 3. Vérification si le préfixe existe dans la table 'prefixe' (colonne 'code')
        $db = \Config\Database::connect();
        $prefixeExiste = $db->table('prefixe')
                            ->where('code', $prefixe)
                            ->countAllResults();

        if ($prefixeExiste === 0) {
            return redirect()->back()->with('error', "Le préfixe ($prefixe) n'est pas autorisé par l'opérateur.");
        }

        // 4. Inscription / Création automatique du compte client s'il n'existe pas encore
        $clientModel = new ClientModel();
        $client = $clientModel->where('telephone', $telephone)->first();