app/Controllers/ClientController.php

SELECT *
FROM `client`
WHERE `client`.`id` = 2
SELECT *
FROM `type_operation`
SELECT `transaction_log`.*, `type_operation`.`nom` as `type_nom`, `c1`.`telephone` as `source_tel`, COALESCE(c2.telephone, transaction_log.telephone_dest) as dest_tel
FROM `transaction_log`
JOIN `type_operation` ON `type_operation`.`id` = `transaction_log`.`id_type_operation`
JOIN `client` `c1` ON `c1`.`id` = `transaction_log`.`id_client_source`
LEFT JOIN `client` `c2` ON `c2`.`id` = `transaction_log`.`id_client_dest`
WHERE `id_client_source` = 2
OR `id_client_dest` = 2
ORDER BY `transaction_log`.`id` DESC
---
    public function dashboard()
    {
        if (session()->get('role') !== 'client') {
            return redirect()->to('/')->with('error', 'Veuillez vous connecter en tant que client.');
        }

        $clientId = session()->get('client_id');
        $clientModel = new ClientModel();
        $client = $clientModel->find($clientId);

        $db = \Config\Database::connect();

        // 1. Types d'opérations
        $types = $db->table('type_operation')->get()->getResultArray();

        // 2. Historique des transactions
        $transactions = $db->table('transaction_log')
            ->select('
                transaction_log.*,
                type_operation.nom as type_nom,
                c1.telephone as source_tel,
                COALESCE(c2.telephone, transaction_log.telephone_dest) as dest_tel
            ')
            ->join('type_operation', 'type_operation.id = transaction_log.id_type_operation')
            ->join('client c1', 'c1.id = transaction_log.id_client_source')
            ->join('client c2', 'c2.id = transaction_log.id_client_dest', 'left')
            ->where('id_client_source', $clientId)
            ->orWhere('id_client_dest', $clientId)
            ->orderBy('transaction_log.id', 'DESC')
            ->get()->getResultArray();

SELECT *
FROM `client`
WHERE `client`.`id` = 2
SELECT *
FROM `type_operation`
WHERE `id` = '3'
SELECT *
FROM `bareme_frais`
WHERE `id_type_operation` = '3'
AND `montant_min` <= 30000
AND `montant_max` >= 30000
---
    public function transaction()
    {
        if (session()->get('role') !== 'client') {
            return redirect()->to('/');
        }

        $clientId       = session()->get('client_id');
        $typeId         = $this->request->getPost('id_type_operation');
        $montant        = (float) $this->request->getPost('montant');
        $destPhone      = trim($this->request->getPost('destinataire') ?? '');
        $inclureRetrait = $this->request->getPost('inclure_frais_retrait') ? true : false;

        if ($montant <= 0) {
            return redirect()->back()->with('error', 'Le montant doit être supérieur à 0.');
        }

        $db = \Config\Database::connect();
        $clientModel = new ClientModel();
        $clientSource = $clientModel->find($clientId);

        $typeOp = $db->table('type_operation')->where('id', $typeId)->get()->getRowArray();
        if (!$typeOp) {
            return redirect()->back()->with('error', 'Type d\'opération invalide.');
        }

        $typeNom = strtolower($typeOp['nom']);

        // --- CALCUL DES FRAIS DE BASE DE L'OPÉRATION ---
        $bareme = $db->table('bareme_frais')
            ->where('id_type_operation', $typeId)
            ->where('montant_min <=', $montant)
            ->where('montant_max >=', $montant)
            ->get()->getRowArray();

UPDATE `client` SET `solde` = 109750
WHERE `client`.`id` IN (2)
INSERT INTO `transaction_log` (`id_type_operation`, `id_client_source`, `id_client_dest`, `telephone_dest`, `montant`, `frais`, `date_transaction`) VALUES ('1', 2, NULL, NULL, 100000, 0, '2026-07-20 16:45:17')
---
        // 1. DÉPÔT
        if (str_contains($typeNom, 'dépôt') || str_contains($typeNom, 'depot')) {
            $nouveauSolde = $clientSource['solde'] + $montant;
            $clientModel->update($clientId, ['solde' => $nouveauSolde]);

            // Historisation dépôt
            $db->table('transaction_log')->insert([
                'id_type_operation' => $typeId,
                'id_client_source'  => $clientId,
                'id_client_dest'    => null,
                'telephone_dest'    => null,
                'montant'           => $montant,
                'frais'             => $frais,
                'date_transaction'  => date('Y-m-d H:i:s')
            ]);

UPDATE `client` SET `solde` = 98900
WHERE `client`.`id` IN (1)
---
            }

            $nouveauSolde = $clientSource['solde'] - $totalA_Debiter;
            $clientModel->update($clientId, ['solde' => $nouveauSolde]);

SELECT COUNT(*) AS `numrows`
FROM `prefixe`
WHERE `code` = '034'
---

            // Détection réseau de la source
            $prefixeSourceCode = substr($clientSource['telephone'], 0, 3);
            $isSourceLocal = $db->table('prefixe')->where('code', $prefixeSourceCode)->countAllResults() > 0;

SELECT *
FROM `type_operation`
WHERE `nom` LIKE '%retrait%' ESCAPE '!'
---
            // Type retrait pour l'option frais inclus
            $typeRetraitId = null;
            if ($inclureRetrait) {
                $typeRetrait = $db->table('type_operation')->like('nom', 'retrait')->get()->getRowArray();

SELECT *
FROM `bareme_frais`
WHERE `id_type_operation` = '3'
AND `montant_min` <= 15000
AND `montant_max` >= 15000
---
            // Calcul des frais par destinataire
            foreach ($destinatairesList as $phone) {
                // Frais de transfert
                $baremeTransfert = $db->table('bareme_frais')
                    ->where('id_type_operation', $typeId)
                    ->where('montant_min <=', $montantParPersonne)
                    ->where('montant_max >=', $montantParPersonne)
                    ->get()->getRowArray();

SELECT *
FROM `bareme_frais`
WHERE `id_type_operation` = 2
AND `montant_min` <= 15000
AND `montant_max` >= 15000
---
                // Frais de retrait facultatifs
                $fraisRetrait = 0.0;
                if ($inclureRetrait && $typeRetraitId) {
                    $baremeRetrait = $db->table('bareme_frais')
                        ->where('id_type_operation', $typeRetraitId)
                        ->where('montant_min <=', $montantParPersonne)
                        ->where('montant_max >=', $montantParPersonne)
                        ->get()->getRowArray();

SELECT COUNT(*) AS `numrows`
FROM `prefixe`
WHERE `code` = '034'
---

                // Application surtaxe inter-opérateur (+10%)
                $prefixeDestCode = substr($phone, 0, 3);
                $isDestLocal = $db->table('prefixe')->where('code', $prefixeDestCode)->countAllResults() > 0;

UPDATE `client` SET `solde` = 78070
WHERE `client`.`id` IN (2)
SELECT *
FROM `client`
WHERE `telephone` = '0340620140'
 LIMIT 1
---

            // Execution : Débit expéditeur
            $nouveauSoldeExpediteur = $clientSource['solde'] - $totalGeneralA_Debiter;
            $clientModel->update($clientId, ['solde' => $nouveauSoldeExpediteur]);

            // Execution : Crédit destinataires + Historisation
            foreach ($simulations as $sim) {
                $destinataire = $clientModel->where('telephone', $sim['phone'])->first();

UPDATE `client` SET `solde` = 75000
WHERE `client`.`id` IN (5)
INSERT INTO `transaction_log` (`id_type_operation`, `id_client_source`, `id_client_dest`, `telephone_dest`, `montant`, `frais`, `date_transaction`) VALUES ('3', 2, 5, '0340620140', 15000, 800, '2026-07-20 16:50:36')
---

                if ($destinataire) {
                    $destId = $destinataire['id'];
                    $clientModel->update($destId, ['solde' => $destinataire['solde'] + $sim['montant']]);
                }

                $db->table('transaction_log')->insert([
                    'id_type_operation' => $typeId,
                    'id_client_source'  => $clientId,
                    'id_client_dest'    => $destId,
                    'telephone_dest'    => $sim['phone'],
                    'montant'           => $sim['montant'],
                    'frais'             => $sim['frais'],
                    'date_transaction'  => date('Y-m-d H:i:s')
                ]);