app/Controllers/ClientController.php

SELECT *
FROM `client`
WHERE `telephone` = '0348140685'
 LIMIT 1
---
                return redirect()->back()->with('error', 'Vous ne pouvez pas effectuer un transfert vers vous-même.');
            }

            $destinataire = $clientModel->where('telephone', $destPhone)->first();

INSERT INTO `transaction_log` (`id_type_operation`, `id_client_source`, `id_client_dest`, `montant`, `frais`, `date_transaction`) VALUES ('3', 1, 2, 1000, 100, '2026-07-20 11:15:19')
---
        }

        // Enregistrement dans l'historique log
        $db->table('transaction_log')->insert([
            'id_type_operation' => $typeId,
            'id_client_source'  => $clientId,
            'id_client_dest'    => $destId,
            'montant'           => $montant,
            'frais'             => $frais,
            'date_transaction'  => date('Y-m-d H:i:s')
        ]);