app/Controllers/OperatorController.php

SELECT *
FROM `prefixe`
SELECT `bareme_frais`.*, `type_operation`.`nom` as `type_nom`
FROM `bareme_frais`
JOIN `type_operation` ON `type_operation`.`id` = `bareme_frais`.`id_type_operation`
SELECT *
FROM `type_operation`
---
    public function index()
    {
        if (session()->get('role') !== 'admin') {
            return redirect()->to('/login/admin')->with('error', 'Accès réservé à l\'administrateur.');
        }

        $db = \Config\Database::connect();
        $clientModel = new ClientModel();

        // 1. Récupérer les préfixes autorisés / locaux
        $prefixes = $db->table('prefixe')->get()->getResultArray();
        $prefixesLocaux = array_column($prefixes, 'code');

        // 2. Récupérer le barème des frais
        $baremes = $db->table('bareme_frais')
            ->select('bareme_frais.*, type_operation.nom as type_nom')
            ->join('type_operation', 'type_operation.id = bareme_frais.id_type_operation')
            ->get()->getResultArray();

        // 3. Récupérer les types d'opérations
        $types = $db->table('type_operation')->get()->getResultArray();

SELECT *
FROM `client`
---
            ->get()->getResultArray();

        // 5. Calcul des clients de l'opérateur local
        $allClients = $clientModel->findAll();