app/Controllers/OperatorController.php

    public function index()
    {
        if (session()->get('role') !== 'operator' && session()->get('role') !== 'admin') {
            return redirect()->to('/');
        }

        $db = \Config\Database::connect();
        $clientModel = new ClientModel();

        // 1. Récupération des préfixes locaux (Telma)
        $prefixesBD = $db->table('prefixe')->select('code')->get()->getResultArray();
        $prefixesLocaux = array_column($prefixesBD, 'code');

        // 2. Statistiques clients locaux
        $totalClients = $clientModel->countAllResults();
        $nbClientsLocaux = 0;
        $allClients = $clientModel->findAll();
        foreach ($allClients as $c) {
            if (in_array(substr($c['telephone'], 0, 3), $prefixesLocaux)) {
                $nbClientsLocaux++;
            }
        }

        // 3. Calcul financier selon la documentation d'interopérabilité
        $transactions = $db->table('transaction_log')
            ->select('transaction_log.*, type_operation.nom as type_nom, c1.telephone as client_source, c2.telephone as client_dest_tel')
            ->join('type_operation', 'type_operation.id = transaction_log.id_type_operation')
            ->join('client c1', 'c1.id = transaction_log.id_client_source')
            ->join('client c2', 'c2.id = transaction_log.id_client_dest', 'left')
            ->orderBy('transaction_log.id', 'DESC')
            ->get()->getResultArray();
---
SELECT `code`
FROM `prefixe`
SELECT COUNT(*) AS `numrows`
FROM `client`
SELECT *
FROM `client`
SELECT `transaction_log`.*, `type_operation`.`nom` as `type_nom`, `c1`.`telephone` as `client_source`, `c2`.`telephone` as `client_dest_tel`
FROM `transaction_log`
JOIN `type_operation` ON `type_operation`.`id` = `transaction_log`.`id_type_operation`
JOIN `client` `c1` ON `c1`.`id` = `transaction_log`.`id_client_source`
LEFT JOIN `client` `c2` ON `c2`.`id` = `transaction_log`.`id_client_dest`
ORDER BY `transaction_log`.`id` DESC

            }
        }

        $prefixes = $db->table('prefixe')->get()->getResultArray();
        $types    = $db->table('type_operation')->get()->getResultArray();
        $baremes  = $db->table('bareme_frais')
            ->select('bareme_frais.*, type_operation.nom as type_nom')
            ->join('type_operation', 'type_operation.id = bareme_frais.id_type_operation')
            ->get()->getResultArray();
---
SELECT *
FROM `prefixe`
SELECT *
FROM `type_operation`
SELECT `bareme_frais`.*, `type_operation`.`nom` as `type_nom`
FROM `bareme_frais`
JOIN `type_operation` ON `type_operation`.`id` = `bareme_frais`.`id_type_operation`